Read data
#+begin_src jupyter-python :session stats :async yes :kernel python3 :results raw
import numpy as np
import matplotlib.pyplot as plt
import pickle
import pandas as pd
import datetime

filename = "aaaPas 2024-05-15.csv"

#df = pd.read_pickle(filename)
df = pd.read_csv(filename)
print("apa")
#+end_src

#+RESULTS:
: /tmp/ipykernel_1200736/3546743257.py:10: DtypeWarning: Columns (27,28,29,30,31,32,33,34,43,44,45,46,47,48,49,50,51,52,61,62,63,64,65,66,67,68,69,70,71,72,73,74) have mixed types. Specify dtype option on import or set low_memory=False.
:   df = pd.read_csv(filename)
: apa

Parse the data to temporal sequences
#+begin_src jupyter-python :session stats :async no :kernel python3 :results raw
n_patients = df[df.columns[2]].iloc[-1]
n_records = len(df[df.columns[2]])
print("Number of Patients:\t", n_patients)   
print("Number of Records:\t", n_records)
print("Number of CareUnits:\t",len(set(list(df["SavedAtCareUnitID"]))))

DiagnosisCode = []
for i in range(1,20):
    DiagnosisCode += list(df["DiagnosisCode"+str(i)].dropna())

DiagnosisCode = list(set(DiagnosisCode))
print("Number of DiagnosisCodes:\t",len(DiagnosisCode))
#+end_src

#+RESULTS:
: Number of Patients:	 260992
: Number of Records:	 752074
: Number of CareUnits:	 678
: Number of DiagnosisCodes:	 7120

Logistic PCA according to cite:landgraf-2015-dimen-reduc
#+begin_src jupyter-python :session stats :async no :kernel python3 :results raw
from LPCA import LogisticPCA
X = np.random.binomial(1, 0.3, (100,5))
lpca = LogisticPCA(m=6, k=1, verbose=True, verbose_interval=10)
lpca.fit(X, maxiters=50, tol=1e-5)



#+end_src

#+RESULTS:

Find clustering parameters
#+begin_src jupyter-python :session stats :async no :kernel python3 :results raw
n_patients = df[df.columns[2]].iloc[-1]
n_records = len(df[df.columns[2]])

patient_serial = list(set(list((df["val_lopnr"]))))

z = np.zeros(n_patients)
for i in patient_serial:
    #z[i] = df.loc[df["val_lopnr"]==1]["Mosaic"].dropna()
    print(df.loc[df["val_lopnr"]==i]["Mosaic"].dropna())

# label = np.zeros(n_patients)
# for i in range(0, n_records):
#     df["Mosaic"].iloc[i]


#+end_src

#+RESULTS:
: /tmp/ipykernel_1157509/2352594607.py:8: FutureWarning: Calling float on a single element Series is deprecated and will raise a TypeError in the future. Use float(ser.iloc[0]) instead
:   z[i] = df.loc[df["val_lopnr"]==1]["Mosaic"].dropna()
# [goto error]
# [goto error]
# [goto error]
# [goto error]
# [goto error]
# [goto error]
# [goto error]


